In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('modelo_relacional.db')
cursor = conn.cursor()

In [2]:
#CREACIÓN TABLAS 

cursor.execute('''
CREATE TABLE IF NOT EXISTS Proveedor (
    proveedor_id INTEGER PRIMARY KEY,
    nombre TEXT,
    direccion TEXT, 
    ciudad TEXT, 
    provincia TEXT
)
''')

cursor.execute('''
CREATE TABLE IF NOT EXISTS Pieza (
    pieza_id INTEGER PRIMARY KEY,
    nombre TEXT,
    color TEXT, 
    precio REAL, 
    categoria_id INT, 
    FOREIGN KEY (categoria_id) REFERENCES Categoria(categoria_id)
)
''')

cursor.execute('''
CREATE TABLE IF NOT EXISTS Categoria (
    categoria_id INTEGER PRIMARY KEY, 
    nombre TEXT
)
''')

cursor.execute('''
CREATE TABLE IF NOT EXISTS Compra (
    pedido_id INTEGER PRIMARY KEY,
    fecha TEXT,
    proveedor_id, 
    pieza_id,
    FOREIGN KEY(proveedor_id) REFERENCES Proveedor(proveedor_id),
    FOREIGN KEY(pieza_id) REFERENCES Pieza(pieza_id)
)
''')

In [3]:
def sql_query(query):
    cursor.execute(query)
    if cursor.description:  
        ans = cursor.fetchall()
        names = [description[0] for description in cursor.description]
        return pd.DataFrame(ans, columns=names)
    else:
        conn.commit() 
        return None

In [4]:
query = '''
SELECT * 
FROM Proveedor
'''

sql_query(query)

Empty DataFrame
Columns: [proveedor_id, nombre, direccion, ciudad, provincia]
Index: []

In [5]:
query = '''   
INSERT INTO Proveedor (proveedor_id, nombre, direccion, ciudad, provincia)
VALUES 
(1, "Juan", "Gran Via", "Madrid", "Madrid" ), 
(2, "Marta", "Av.Basagoiti", "Bilbao", "Bizkaia"), 
(3, "Luis", "Calle 123", "Barcelona", "Cataluña");
'''

sql_query(query)

In [6]:
query = '''  
SELECT * 
FROM Proveedor
'''

sql_query(query)

   proveedor_id nombre     direccion     ciudad provincia
0             1   Juan      Gran Via     Madrid    Madrid
1             2  Marta  Av.Basagoiti     Bilbao   Bizkaia
2             3   Luis     Calle 123  Barcelona  Cataluña

In [7]:
query = '''   
INSERT INTO Pieza (pieza_id, nombre, color, precio, categoria_id)
VALUES 
(1, 'Tornillo', 'Plateado', 0.75, 101),
(2, 'Tuerca', 'Negro', 1.20, 102),
(3, 'Clavo', 'Dorado', 5.50, 103)
'''

sql_query(query)

In [8]:
query = '''  
SELECT * 
FROM Pieza
'''

sql_query(query)

   pieza_id    nombre     color  precio  categoria_id
0         1  Tornillo  Plateado    0.75           101
1         2    Tuerca     Negro    1.20           102
2         3     Clavo    Dorado    5.50           103

In [9]:
query = '''   
INSERT INTO Categoria (categoria_id, nombre)
VALUES 
(101, "Estrella" ),
(102, "Alemana"),
(103, "Cadena")
'''

sql_query(query)

In [10]:
query = '''  
SELECT * 
FROM Categoria
'''

sql_query(query)

   categoria_id    nombre
0           101  Estrella
1           102   Alemana
2           103    Cadena

In [12]:
query = '''   
INSERT INTO Compra (pedido_id, fecha, proveedor_id, pieza_id)
VALUES 
(1, '2023-03-01', 2, 1),
(2, '2023-05-25', 2, 2),
(3, '2023-12-03', 1, 3);
'''

sql_query(query)

In [13]:
query = '''  
SELECT * 
FROM Compra
'''

sql_query(query)

   pedido_id       fecha  proveedor_id  pieza_id
0          1  2023-03-01             2         1
1          2  2023-05-25             2         2
2          3  2023-12-03             1         3